FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_RX63N/CARRIER_RX63N.c
/*-------------------------------------------------------------------------*
 * File:  DK_TS_RX63N.c
 *-------------------------------------------------------------------------*
 * Description:
 *      Bring up the DK_TS_RX63N
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2012 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/

#include <Config.h>

#include <uEZ.h>
#include <uEZADC.h>
#include <uEZAudioAmp.h>
#include <uEZBSP.h>
#include <uEZDevice.h>
#include <uEZDeviceTable.h>
#include <uEZFile.h>
#include <uEZNetwork.h>
#include <uEZProcessor.h>
#include <uEZStream.h>
#include <UEZPlatformAPI.h>
#include <UEZI2C.h>

#include <Device/SPIBus.h>
#include <Device/ADCBank.h>
#include <Device/AudioAmp.h>
#include <Device/FileSystem.h>
#include <Device/Flash.h>
#include <Device/LCD.h>
#include <Device/MassStorage.h>
#include <Device/PWM.h>
#include <Device/Stream.h>
#include <Device/ToneGenerator.h>
#include <Device/Touchscreen.h>
#include <Device/I2CBus.h>

#include <Source/Devices/ADC/Generic/Generic_ADC.h>
#include <Source/Devices/AudioAmp/NXP/TDA8551_T/AudioAmp_TDA8551T.h>
#include <Source/Devices/Backlight/Generic/BacklightPWMControlled/BacklightPWM.h>
#include <Source/Devices/Flash/Renesas/RX62N/Flash_Renesas_RX62N.h>
#include <Source/Devices/MassStorage/SDCard/SDCard_MS_driver_SPI.h>
#include <Source/Devices/Network/lwIP/Network_lwIP.h>
#include <Source/Devices/ToneGenerator/Generic/PWM/ToneGenerator_Generic_PWM.h>
#include <Source/Devices/Touchscreen/Generic/DirectDrive/DirectDrive_TS.h>
#include <Source/Devices/RTC/Generic/Generic_RTC.h>
#include <Source/Devices/RTC/NXP/PCF8563/RTC_PCF8563.h>
#include <Source/Devices/Temperature/NXP/LM75A/Temperature_LM75A.h>
#include <Source/Devices/Accelerometer/Freescale/MMA7455/Freescale_MMA7455.h>
#include <Source/Devices/Audio Codec/Wolfson/WM8731/AudioCodec_WM8731.h>
#include <Source/Devices/Button/NXP/PCA9551/Button_PCA9551.h>
#include <Source/Devices/LED/NXP/PCA9551/LED_NXP_PCA9551.h>

#include <Source/Processor/Renesas/RX63N/uEZProcessor_RX63N.h>
#include <Source/Processor/Renesas/RX63N/RX63N_ADCBank_S12AD.h>
#include <Source/Processor/Renesas/RX63N/RX63N_GPIO.h>
#include <Source/Processor/Renesas/RX63N/RX63N_Serial.h>
#include <Source/Processor/Renesas/RX63N/RX63N_UtilityFuncs.h>
#include <Source/Processor/Renesas/RX63N/RX63N_I2C.h>
#include <Source/Processor/Renesas/RX63N/RX63N_PWM_TPU.h>
#include <Source/Processor/Renesas/RX63N/RX63N_Flash.h>
#include <Source/Processor/Renesas/RX63N/RX63N_RTC.h>

#include <Source/Library/GUI/FDI/SimpleUI/SimpleUI_Types.h>
#include <Source/Library/GUI/FDI/SimpleUI/SimpleUI.h> // Needs to go away!

#include "DirectDrive/CARRIER_RX63N_DirectDrive.h"

#include "UEZPlatform.h"
#include <uEZAudioMixer.h>

#ifndef configKERNEL_INTERRUPT_PRIORITY
#define configKERNEL_INTERRUPT_PRIORITY     4
#endif

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
T_uezTask G_mainTask;
static T_uezDevice G_stdout = 0;
static T_uezDevice G_stdin = 0;
TBool G_TriLED = EFalse;

/*---------------------------------------------------------------------------*
 * Initialize the Vector Table
 *---------------------------------------------------------------------------*/
#include <RXToolset/vecttbl.c>

/*---------------------------------------------------------------------------*
 * Setting of B,R Section
 *---------------------------------------------------------------------------*/
#include <RXToolset/dbsct.c>

#include <stdio.h>
size_t fwrite(const void *ptr, size_t size, size_t nmemb, FILE * fp) {
	write(0, ptr, nmemb*size);
	return nmemb;
}

/*---------------------------------------------------------------------------*
 * Routine:  vApplicationSetupTimerInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      The RX port uses this callback function to configure its tick   
 *		interrupt. This allows the application to choose the tick interrupt
 *		source.
 *---------------------------------------------------------------------------*/
void vApplicationSetupTimerInterrupt(void)
{
    /* Enable compare match timer 0. */
    MSTP( CMT0) = 0;

    /* Interrupt on compare match. */
    CMT0.CMCR.BIT.CMIE = 1;

    /* Set the compare match value. */
    CMT0.CMCOR = (unsigned short)(((PCLK_FREQUENCY / configTICK_RATE_HZ) - 1) / 8);

    /* Divide the PCLK by 8. */
    CMT0.CMCR.BIT.CKS = 0;

    /* Enable the interrupt... */
    _IEN( _CMT0_CMI0) = 1;

    /* ...and set its priority to the application defined kernel priority. */
    _IPR( _CMT0_CMI0) = configKERNEL_INTERRUPT_PRIORITY;

    /* Start the timer. */
    CMT.CMSTR0.BIT.STR0 = 1;
}

/*---------------------------------------------------------------------------*
 * Task:  Heartbeat
 *---------------------------------------------------------------------------*
 * Description:
 *      Blink heartbeat LED
 * Inputs:
 *      T_uezTask aMyTask            -- Handle to this task
 *      void *aParams               -- Parameters.  Not used.
 * Outputs:
 *      TUInt32                     -- Never returns.
 *---------------------------------------------------------------------------*/
TUInt32 Heartbeat(T_uezTask aMyTask, void *aParams)
{
	TUInt8 circle = 0;
	
	UEZGPIOOutput(GPIO_PG7);
	UEZGPIOSet(GPIO_PG7);
	UEZGPIOOutput(GPIO_PG6);
	UEZGPIOSet(GPIO_PG6);
	UEZGPIOOutput(GPIO_PG5);
	UEZGPIOSet(GPIO_PG7);
    // Blink
    for (;;) {
		if(G_TriLED) {
			if (circle==0) {
				UEZGPIOSet(GPIO_PG7);
				UEZGPIOClear(GPIO_PG5);
				circle++;
			} else if(circle==1) {
				UEZGPIOSet(GPIO_PG5);
				UEZGPIOClear(GPIO_PG6);
				circle++;
			} else if(circle==2) {
				UEZGPIOSet(GPIO_PG6);
				UEZGPIOClear(GPIO_PG7);
				circle=0;
			}
			UEZTaskDelay(1000);
		}	
		else {
	        UEZGPIOSet(GPIO_PG6);
			UEZGPIOSet(GPIO_PG7);
			UEZGPIOSet(GPIO_PG5);
	        UEZTaskDelay(250);
			UEZGPIOClear(GPIO_PG6);
	        UEZTaskDelay(250);
		}
    }                    
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSPDelayMS
 *---------------------------------------------------------------------------*
 * Description:
 *      Use a delay loop to approximate the time to delay.
 *      Should use UEZTaskDelayMS() when in a task instead.
 *---------------------------------------------------------------------------*/
void UEZBSPDelayMS(unsigned int aMilliseconds)
{
    TUInt32 i;
    // TODO: Calibrate based on the speed of processor
    while (aMilliseconds--) {
        for (i = 0; i < PROCESSOR_OSCILLATOR_FREQUENCY/5000; i++) {
        }
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSPDelayUS
 *---------------------------------------------------------------------------*
 * Description:
 *      Use a delay loop to approximate the time to delay.
 *      Should use UEZTaskDelay when in a task instead.
 *---------------------------------------------------------------------------*/
void UEZBSPDelayUS(unsigned int aMicroseconds)   
{
    TUInt32 i;
    // TODO: Calibrate based on the speed of processor
    while (aMicroseconds--) {
        for (i = 0; i < PROCESSOR_OSCILLATOR_FREQUENCY/5000000; i++) {
        }
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_PLLConfigure
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure the PLL
 *---------------------------------------------------------------------------*/
void UEZBSP_PLLConfigure(void)
{
    /* 
    Clock Description              Frequency
    ----------------------------------------
    Input Clock Frequency............  12 MHz
    PLL frequency (x16).............. 192 MHz
    Internal Clock Frequency.........  96 MHz    
    Peripheral Clock Frequency.......  96 MHz
    USB Clock Frequency..............  48 MHz
    External Bus Clock Frequency.....  48 MHz */

	unsigned int i;

	// Unlock protection bits
    SYSTEM.PRCR.WORD = 0xA50B;			/* Protect off */
    MPC.PWPR.BIT.B0WI = 0 ;     		/* Unlock protection register */
    MPC.PWPR.BIT.PFSWE = 1 ;    		/* Unlock MPC registers */
	
    /* Uncomment if not using sub-clock */
	//SYSTEM.SOSCCR.BYTE = 0x01;			/* stop sub-clock */
    SYSTEM.SOSCCR.BYTE = 0x00;			/* Enable sub-clock for RTC */
	SYSTEM.MOSCWTCR.BYTE = 0x0D;		/* Wait 131,072 cycles * 12 MHz = 10.9 ms */
	SYSTEM.PLLWTCR.BYTE = 0x04;			/* PLL wait is 4,194,304 cycles (default) * 192 MHz (12 MHz * 16) = 20.1 ms*/
	SYSTEM.PLLCR.WORD = 0x0F00;			/* x16 @PLL */
	SYSTEM.MOSCCR.BYTE = 0x00;			/* EXTAL ON */
	SYSTEM.PLLCR2.BYTE = 0x00;			/* PLL ON */

