FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_RX63N/CARRIER_RX63N.c
	for(i = 0;i< 0x168;i++)             /* wait over 12ms */
    {
        nop() ;
	}

    /* SCKCR - System Clock Control Register
    FCK[3:0]    0x2 = Flash clock: PLL/4 = (192 / 4) = 48 MHz
    ICK[3:0]    0x1 = System clock: PLL/2 = (192 / 2) = 96 MHz
    PSTOP1      0x0 = BCLK pin output is enabled
    BCK[3:0]    0x2 = BCLK: PLL/4 = 48 MHz
	PCKA[3:0]   0x1 = Peripheral clock A: PLLx2
    PCKB[3:0]   0x2 = Peripheral clock B: PLL/4, PCK = (PLLx2)/4 = 96 MHz
    */
	SYSTEM.SCKCR.LONG = 0x21021222;		/* ICK=PLL/2,BCK,FCK,PCK=PLL/2 */
	// 0x21021222

    /* SCKCR2 - System Clock Control Register 2 
    UCK[3:0]    0x03 = USB clock is PLL/4 = 48 MHz
    IEBCK[3:0]  0x01 = IE Bus clock is PLL/2 = 96 MHz
    */
    SYSTEM.SCKCR2.WORD = 0x0031;

	SYSTEM.SCKCR3.WORD = 0x0400;		/* ICLK, PCLKB, FCLK, BCLK, IECLK, and USBCLK all come from PLL circuit */

    //SYSTEM.PRCR.WORD = 0xA500;			/* protect on */
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_CPU_PinConfigInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Immediately configure the port pins
 *---------------------------------------------------------------------------*/
void UEZBSP_CPU_PinConfigInit(void)
{
    // Place any pin configuration that MUST be initially here (at power up
    // but before even SDRAM is initialized)
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_InterruptsReset
 *---------------------------------------------------------------------------*
 * Description:
 *      Do the first initialization of the interrupts.
 *---------------------------------------------------------------------------*/
void UEZBSP_InterruptsReset(void)
{
	InterruptsReset();
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_RAMInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize the external RAM.
 *---------------------------------------------------------------------------*/
void UEZBSP_RAMInit(void)
{
	TUInt32 delay;
	
	RX63N_UnlockProtectionBits();	
	
    // Configure port pins --------------
    // Enable On Chip ROM & External BUS
    SYSTEM.SYSCR0.WORD = 0x5A03;

    // Port A should be A1-A7 and Port B should be A8 - A14
	MPC.PFBCR0.BIT.ADRLE=1;
	MPC.PFAOE0.BIT.A8E=1;
	MPC.PFAOE0.BIT.A9E=1;
	MPC.PFAOE0.BIT.A10E=1;
	MPC.PFAOE0.BIT.A11E=1;
	MPC.PFAOE0.BIT.A12E=1;
	MPC.PFAOE0.BIT.A13E=1;
	MPC.PFAOE0.BIT.A14E=1;
	
    // Port D is D0-D7 and Port E is D8-D15
    //IOPORT.PF5BUS.BIT.DHE = 1;
	MPC.PFBCR0.BIT.DHE=1;

    // Configure P61 for SDRAM SDCS#
    // and P62 for RAS#
    // and P63 for CAS#
    // and P64 for WE#
    // and P65 for CKE
    // and P66 for DQM0
//    IOPORT.PF6BUS.BIT.MDSDE = 1;
    // and P67 for DQM1
    //IOPORT.PF6BUS.BIT.DQM1E = 1;
	MPC.PFBCR1.BIT.MDSDE=1;
	
    // and enable SDCLK port pin
    //;IOPORT.PF6BUS.BIT.SDCLKE = 1;
	MPC.PFBCR1.BIT.SDCLKE=1;
	MPC.PFBCR1.BIT.DQM1E=1;
	
// Set MDR on io pins
	

    // Wait at least 100 uS (100 counts of about 100 MHz)
    for (delay=0; delay<100*100; delay++)
        {}

    // SDRAM Initialization
    // Set the interval at which auto-refresh commands are issued in the
    // SDRAM initialization sequence
    BSC.SDIR.BIT.ARFI = 3-3;
    // Set the number of times auto-refresh is to be performed in the
    // SDRAM initialization sequence
    BSC.SDIR.BIT.ARFC = 15;
    // Set the number of precharge cycles in the SDRAM initialization sequence.
    BSC.SDIR.BIT.PRC = 3-3;

    // Start the SDRAM initialization
    BSC.SDICR.BIT.INIRQ = 1;
    // Wait for it to complete
    while (BSC.SDSR.BIT.INIST)
        {}

    // Configure more the SDRAM
    // Set little endian
    BSC.SDCMOD.BIT.EMODE = 0;
    // Set 16-bit databus
    BSC.SDCCR.BIT.BSIZE = 0;
    // Set Mode Register Definition
    //   1100 0000 0000
    //   1098 7654 3210
    //   ---- ---- ----
    //   00               Reserved
    //     1              WB
    //                      1 for Single Location Address
    //                      0 for Programmed Burst Length
    //      0 0           Op Mode
    //                      00 for Standard Operation
    //         010        CAS Latency (010 = 2, 011 = 3, 001 = 1)
    //                      000, 001, 100, 101, 110, 111 = Reserved
    //                      010 = CAS 2
    //                      011 = CAS 3
    //             0      Burst Type
    //                      0 = Sequential
    //                      1 = Interleaved
    //              000   Burst Length
    //                      000 = 1
    //                      001 = 2
    //                      010 = 4
    //                      011 = 8
    //                      100, 101, 110 = Reserved
    //                      111 = Reserved if BT=0, else Full Page
    //   ---- ---- ----
    //   0010 0010 0000    <-- 0x220
#if (SDRAM_CAS_LATENCY==3)
    BSC.SDMOD.WORD = 0x230;
#elif (SDRAM_CAS_LATENCY==2)
    BSC.SDMOD.WORD = 0x220;
#elif (SDRAM_CAS_LATENCY==1)
    BSC.SDMOD.WORD = 0x210;
#else
    #error "SDRAM_CAS_LATENCY MUST BE SET!"
#endif

    // Set the refresh cycle count to 5
    BSC.SDRFCR.BIT.REFW = 5-1;

    // Set the refresh period
    BSC.SDRFCR.BIT.RFC =
        (((BCLK_FREQUENCY/1000) * SDRAM_REFRESH_TIME)
            / SDRAM_NUM_ROWS)-1;
        
    // Set CAS to 2 cycles
    //   These bits specify the column latency of the SDRAM controller. This
    //   setting only affects the latency setting on the SDRAM controller side.
    //   To specify the column latency for externally connected SDRAM, use the
    //   separate SDRAM mode register (SDMOD), which is described below.
    BSC.SDTR.BIT.CL = SDRAM_CAS_LATENCY;

    // Write recovery interval = 1 cycle
    //   This bit specifies the interval that must elapse between the SDRAM
    //   write command (WRIT) and deactivation (PALL).
    BSC.SDTR.BIT.WR = 0;

    // Row precharge interval = 1-8 cycles
    //   These bits specify the minimum number of cycles that must elapse
    //   between the SDRAM deactivation command (PALL) and the next valid
    //   command.
    BSC.SDTR.BIT.RP = SDRAM_ROW_PRECHARGE-1;     

    // Row column latency = 1 cycle
    //   These bits specify the SDRAM row column latency.
    BSC.SDTR.BIT.RCD = 0;

    // Row active interval = 1 cycle
    //   These bits specify the minimum interval that must elapse between the
    //   SDRAM row activation command (ACTV) and deactivation (PALL).
    BSC.SDTR.BIT.RAS = 0;

    // Set Address Multiplex Select to 8 bits
    //   These bits select the size of the shift toward the lower half of the
    //   row address in row address/column address multiplexing. These bits
    //   also select the row address bits to be used for comparison in the
    //   SDRAMC continuous access operation.
    BSC.SDADR.BIT.MXC = 1;//8-8;

    // Auto-refresh operation is enabled
    BSC.SDRFEN.BIT.RFEN = 1;

    //Enables the operation of the SDRAM address space
    BSC.SDCCR.BIT.EXENB = 1;
	
