FutureDesigns/uEZ/uEZ/Source/Platform/FDI/CARRIER_RX63N/CARRIER_RX63N.c
    // Wired network needs an EMAC
    RX63N_176_EMAC_RMII_Require();

    // Create the network driver for talking to lwIP on a wired
    // network.
    Network_lwIP_Create("WiredNetwork0");
}


/*---------------------------------------------------------------------------*
 * Routine:
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the networking for Wired connections.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Button_Require(void)
{
    T_uezDeviceWorkspace *p_button0;
    T_uezDevice i2c0;
    T_uezDeviceWorkspace *p_i2c0;

    DEVICE_CREATE_ONCE();

    UEZDeviceTableFind("I2C0", &i2c0);
    UEZDeviceTableGetWorkspace(i2c0, (T_uezDeviceWorkspace **)&p_i2c0);

    UEZDeviceTableRegister(
        "ButtonBank0",
        (T_uezDeviceInterface *)&ButtonBank_NXP_PCA9551_Interface,
        0,
        &p_button0);
    ButtonBank_NXP_PCA9551_Configure(p_button0, (DEVICE_I2C_BUS **)p_i2c0, 0xC0>>1);
}

/*---------------------------------------------------------------------------*
 * Routine:
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the networking for Wired connections.
 *---------------------------------------------------------------------------*/
void UEZPlatform_LED_Require(void)
{
    T_uezDeviceWorkspace *p_led0;
    T_uezDevice i2c0;
    T_uezDeviceWorkspace *p_i2c0;

    DEVICE_CREATE_ONCE();

    UEZDeviceTableFind("I2C0", &i2c0);
    UEZDeviceTableGetWorkspace(i2c0, (T_uezDeviceWorkspace **)&p_i2c0);

    UEZDeviceTableRegister(
        "LEDBank0",
        (T_uezDeviceInterface *)&LEDBank_NXP_PCA9551_Interface,
        0,
        &p_led0);
    LED_NXP_PCA9551_Configure(p_led0, (DEVICE_I2C_BUS **)p_i2c0, 0xC0>>1);
}

/*---------------------------------------------------------------------------*
 * Routine:  uEZPlatformInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize the board with all the proper settings.
 *      Registers all peripherals specific to this board.
 *---------------------------------------------------------------------------*/
void uEZPlatformInit(void)
{
    // Do any initialiation necessary before the RTOS is started
}

void UEZPlatform_Standard_Require(void)
{
	UEZPlatform_LCD_Require();
	
    UEZPlatform_Console_Require(UEZ_CONSOLE_WRITE_BUFFER_SIZE,
            UEZ_CONSOLE_READ_BUFFER_SIZE);
    
	UEZPlatform_Touchscreen_Require();
	UEZPlatform_S12AD_Require();
	UEZPlatform_SPI0_Require();
	UEZPlatform_Temp0_Require();
	UEZPlatform_Accel0_Require();
	UEZPlatform_Speaker_Require();
	UEZPlatform_AudioAmp_Require();
	UEZPlatform_DataFlash_Require();
	UEZPlatform_ERTC_Require();
	UEZPlatform_IRTC_Require();
	UEZPlatform_LED_Require();
	UEZPlatform_Button_Require();
	UEZPlatform_AudioCodec_Require();
	UEZPlatform_EEPROM_Require();  
	UEZPlatform_AudioMixer_Require();
}

void UEZPlatform_Full_Require(void)
{
    // Setup console immediately
	UEZPlatform_LCD_Require();
	
    UEZPlatform_Console_Require(UEZ_CONSOLE_WRITE_BUFFER_SIZE,
            UEZ_CONSOLE_READ_BUFFER_SIZE);
    
	UEZPlatform_Touchscreen_Require();
	UEZPlatform_S12AD_Require();
	UEZPlatform_SPI0_Require();
	UEZPlatform_Temp0_Require();
	UEZPlatform_Accel0_Require();
	UEZPlatform_Speaker_Require();
	UEZPlatform_AudioAmp_Require();
	UEZPlatform_DataFlash_Require();
	UEZPlatform_ERTC_Require();
	UEZPlatform_IRTC_Require();
	UEZPlatform_LED_Require();
	UEZPlatform_Button_Require();
	UEZPlatform_AudioCodec_Require();
	UEZPlatform_EEPROM_Require();
}

void UEZPlatform_Minimal_Require(void)
{
    // Setup console immediately
    UEZPlatform_Console_Require(UEZ_CONSOLE_WRITE_BUFFER_SIZE,
            UEZ_CONSOLE_READ_BUFFER_SIZE);
}

TUInt16 UEZPlatform_LCDGetHeight(void)
{
    return UEZ_LCD_DISPLAY_HEIGHT;
}
TUInt16 UEZPlatform_LCDGetWidth(void)
{
    return UEZ_LCD_DISPLAY_WIDTH;
}
#include <Source/Library/GUI/FDI/SimpleUI/SimpleUI_Types.h>
TUInt32 UEZPlatform_LCDGetFrame(TUInt16 aFrameNum)
{
    return (TUInt32)FRAME(aFrameNum);
}

TUInt32 UEZPlatform_LCDGetFrameBuffer(void)
{
    return (TUInt32)LCD_FRAME_BUFFER;
}

TUInt32 UEZPlatform_LCDGetFrameSize(void)
{
    return FRAME_SIZE;
}

TUInt32 UEZPlatform_SerialGetDefaultBaud(void)
{
    return SERIAL_PORTS_DEFAULT_BAUD;
}

TUInt32 UEZPlatform_ProcessorGetFrequency(void)
{
    return PROCESSOR_OSCILLATOR_FREQUENCY;
}

TUInt32 UEZPlatform_GetEMACPHYAddress(void)
{
    return 1; // National DP83640
}

TUInt32 UEZPlatform_GetBaseAddress(void)
{
    return LCD_DISPLAY_BASE_ADDRESS;
}

void UEZPlatformWriteChar(char aChar)
{
    putchar(aChar);
}

#include "LCD.h"
const void* UEZPlatform_GUIColorConversion(void)
{
    return GUICC_M565;
}

T_pixelColor SUICallbackRGBConvert(int r, int g, int b)
{
    return RGB(r, g, b);
}

void *SUICallbackGetLCDBase(void)
{
    return (void *)(LCD_FRAME_BUFFER);
}
    
void SUICallbackSetLCDBase(void *aBaseAddress)
{
    extern TUInt16 * LCDSetActiveRaster(TUInt32 frame_request);
    extern void HandleFail(void);

    //LCDSetActiveRaster((TUInt32)aBaseAddress);
}

extern void WriteByteInFrameBufferWithAlpha(
        UNS_32 aAddr,
        COLOR_T aPixel,
        T_swimAlpha aAlpha)
{
    static COLOR_T mask = ~((1 << 10) | (1 << 5) | (1 << 0));
    COLOR_T *p = (COLOR_T *)aAddr;

    switch (aAlpha) {
        case SWIM_ALPHA_50:
            *p = (((*p & mask) >> 1) + ((aPixel & mask) >> 1));
            break;
    }
}

void ForceCodeNotToBeRemovedDuringOptimizedLink(void)
{
	extern void vSoftwareInterruptEntry(void);
	
	// This code is a trick to the HEW compiler.  It ensures
	// the the list of functions are definitely compiled into
	// the code instead of being optimized out.  Without this
	// function, the uEZ code will not work with HEW Renesas RX
	// compiler! -- 3/19/2012
	vSoftwareInterruptEntry();
}

/*---------------------------------------------------------------------------*
 * Routine:  main
 *---------------------------------------------------------------------------*
 * Description:
 *      The main() routine in UEZ is only a stub that is used to start
 *      the whole UEZ system.  UEZBSP_Startup() is immediately called.
 * Outputs:
 *      int -- not used, 0
 *---------------------------------------------------------------------------*/
int main(void)
{
	TUInt32 i;
	
	PORTC.PDR.BIT.B3 = 1; // RESET_IO
	PORTC.PODR.BIT.B3 = 1; // RESET_IO
    for (i=0;i<1000000;i++){}
    PORTC.PODR.BIT.B3 = 0; // RESET_IO
    for (i=0;i<1000000;i++){}

	UEZBSP_Startup();
    while (1) {
		// never should get here
		ForceCodeNotToBeRemovedDuringOptimizedLink();
    } 
}

/*-------------------------------------------------------------------------*
 * End of File:  uEZPlatform.c
 *-------------------------------------------------------------------------*/
